load_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="coordinadora">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">12</intProp>
        <intProp name="ThreadGroup.ramp_time">12</intProp>
        <longProp name="ThreadGroup.duration">600</longProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">100</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request">
          <stringProp name="HTTPSampler.path">/recogidas/cm-solicitud-recogidas-ms/solicitud-recogida</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;tipoEnvio&quot;: &quot;1&quot;,&#xd;
    &quot;tipoProducto&quot;: &quot;4&quot;,&#xd;
    &quot;indicativo&quot;: &quot;57&quot;,&#xd;
    &quot;tipoDocumento&quot;: &quot;13&quot;,&#xd;
    &quot;email&quot;: &quot;ana@gmail.com&quot;,&#xd;
    &quot;personaEntrega&quot;: &quot;1&quot;,&#xd;
    &quot;indicativoEntrega&quot;: &quot;57&quot;,&#xd;
    &quot;medidasAproximadas&quot;: [&#xd;
        {&#xd;
            &quot;id&quot;: 2,&#xd;
            &quot;tipoPaq&quot;: &quot;Par de zapatos&quot;,&#xd;
            &quot;nombrePaq&quot;: &quot;Par de za...&quot;,&#xd;
            &quot;cantidad&quot;: 1&#xd;
        }&#xd;
    ],&#xd;
    &quot;ciudad&quot;: &quot;Envigado (Ant)&quot;,&#xd;
    &quot;via&quot;: &quot;&quot;,&#xd;
    &quot;numero&quot;: &quot;&quot;,&#xd;
    &quot;detalle&quot;: &quot;PARQUE SAN JOSE BOD 14&quot;,&#xd;
    &quot;tipoVia&quot;: 16,&#xd;
    &quot;nombres&quot;: &quot;prueba&quot;,&#xd;
    &quot;apellidos&quot;: &quot;prueba1&quot;,&#xd;
    &quot;documento&quot;: &quot;1036149000&quot;,&#xd;
    &quot;celular&quot;: &quot;3005777777&quot;,&#xd;
    &quot;ciudadDetalle&quot;: {&#xd;
        &quot;nombre_terminal_operativa&quot;: &quot;Medellin&quot;,&#xd;
        &quot;tipo_servicio&quot;: &quot;A&quot;,&#xd;
        &quot;dane_ciudad&quot;: &quot;05266&quot;,&#xd;
        &quot;dane_actual&quot;: &quot;05266000&quot;,&#xd;
        &quot;ciudad_tarifa&quot;: &quot;05266000&quot;,&#xd;
        &quot;sms&quot;: true,&#xd;
        &quot;cubre_mqp&quot;: true,&#xd;
        &quot;codigo_postal&quot;: &quot;055428&quot;,&#xd;
        &quot;terminal_operativa&quot;: 2,&#xd;
        &quot;cubre_me&quot;: true,&#xd;
        &quot;area_telefono&quot;: 4,&#xd;
        &quot;observaciones2&quot;: &quot;FCE - RD - FD - RCE&quot;,&#xd;
        &quot;codigo&quot;: &quot;05266000&quot;,&#xd;
        &quot;tipo_poblacion&quot;: &quot;D&quot;,&#xd;
        &quot;activo&quot;: true,&#xd;
        &quot;codigo_terminal&quot;: 2,&#xd;
        &quot;codigo_interno&quot;: 204,&#xd;
        &quot;mensajeria&quot;: true,&#xd;
        &quot;cubre_mm&quot;: false,&#xd;
        &quot;departamento&quot;: &quot;05&quot;,&#xd;
        &quot;cubre_cm&quot;: false,&#xd;
        &quot;nombre&quot;: &quot;Envigado (Ant)&quot;,&#xd;
        &quot;abreviado&quot;: &quot;ENVIGADO&quot;,&#xd;
        &quot;nombre_terminal&quot;: &quot;Medellin&quot;,&#xd;
        &quot;observaciones&quot;: &quot;&quot;&#xd;
    },&#xd;
    &quot;direccion&quot;: &quot;Calle ${__Random(1,100)} # ${__Random(1,100)}-${__Random(1,100)}&quot;,&#xd;
    &quot;fechaRecogida&quot;: &quot;2024-11-23&quot;,&#xd;
    &quot;nombreEntrega&quot;: &quot;Juan&quot;,&#xd;
    &quot;apellidosEntrega&quot;: &quot;Pérez&quot;,&#xd;
    &quot;celularEntrega&quot;: &quot;3001234567&quot;,&#xd;
    &quot;emailUsuario&quot;: &quot;juan.perez@gmail.com&quot;,&#xd;
    &quot;descripcionTipoVia&quot;: &quot;Calle&quot;,&#xd;
    &quot;aplicativo&quot;: &quot;envios&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Response Time Graph">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults">
        <stringProp name="HTTPSampler.domain">apiv2-test.coordinadora.com</stringProp>
        <stringProp name="HTTPSampler.protocol">https</stringProp>
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
      </ConfigTestElement>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>